benchmark/server/wrk_benchmark.txt
Running 30s test @ http://127.0.0.1:80/httptest/wikipedia_russia.html
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.03ms    4.40ms 225.92ms   87.61%
    Req/Sec   217.74     15.99   260.00     75.17%
  Latency Distribution
     50%   22.84ms
     75%   24.81ms
     90%   26.68ms
     99%   30.55ms
  13007 requests in 30.00s, 11.64GB read
Requests/sec:    433.51
Transfer/sec:    397.15MB