benchmark/server/wrk_benchmark.txt
Running 30s test @ http://127.0.0.1:80/httptest/wikipedia_russia.html
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.33ms    3.41ms  43.57ms   71.48%
    Req/Sec   214.13     16.88   353.00     74.88%
  Latency Distribution
     50%   22.99ms
     75%   25.21ms
     90%   27.75ms
     99%   33.28ms
  12814 requests in 30.10s, 11.40GB read
Requests/sec:    425.73
Transfer/sec:    387.79MB